<details ><summary>plan for talos-bootstrap 2025-07-04 04:32:15 (UTC)</summary>
    <details ><summary>Locking successful</summary>
  Project vaughnw128/immanent-grove#talos-bootstrap has been locked by PR #55
</details>

<details open="true"><summary>Plan output</summary>

```terraform
Terraform will perform the following actions:

  # proxmox_virtual_environment_download_file.talos_nocloud_image["atuan"] must be replaced
-/+ resource "proxmox_virtual_environment_download_file" "talos_nocloud_image" {
      ~ id                      = "local:iso/talos-nocloud-amd64.img" -> (known after apply)
      ~ size                    = 1306525696 -> (known after apply)
      ~ url                     = "https://factory.talos.dev/image/58e4656b31857557c8bad0585e1b2ee53f7446f4218f3fae486aa26d4f6470d8/v1.9.2/nocloud-amd64.raw.zst" -> "https://factory.talos.dev/image/84f66f3fa52900a0234636ae1da07d5b356cce774673951af35866142158fce6/v1.10.5/nocloud-arm64.raw.zst" # forces replacement
        # (9 unchanged attributes hidden)
    }

  # proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"] must be replaced
-/+ resource "proxmox_virtual_environment_download_file" "talos_nocloud_image" {
      ~ id                      = "local:iso/talos-nocloud-amd64.img" -> (known after apply)
      ~ size                    = 1306525696 -> (known after apply)
      ~ url                     = "https://factory.talos.dev/image/58e4656b31857557c8bad0585e1b2ee53f7446f4218f3fae486aa26d4f6470d8/v1.9.2/nocloud-amd64.raw.zst" -> "https://factory.talos.dev/image/84f66f3fa52900a0234636ae1da07d5b356cce774673951af35866142158fce6/v1.10.5/nocloud-arm64.raw.zst" # forces replacement
        # (9 unchanged attributes hidden)
    }

  # proxmox_virtual_environment_vm.talos_vm["controlplane"] must be replaced
-/+ resource "proxmox_virtual_environment_vm" "talos_vm" {
      ~ id                      = "100" -> (known after apply)
      ~ ipv4_addresses          = [
          - [
              - "127.0.0.1",
              - "169.254.116.108",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "10.0.0.50",
            ],
          - [],
          - [
              - "10.244.2.221",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
        ] -> (known after apply)
      ~ ipv6_addresses          = [
          - [
              - "::1",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "fe80::be24:11ff:fe7c:cce6",
            ],
          - [
              - "fe80::8cc6:b2ff:fe3d:9515",
            ],
          - [
              - "fe80::3057:8fff:fe26:a275",
            ],
          - [
              - "fe80::8eb:50ff:fec4:8115",
            ],
          - [
              - "fe80::70ba:9aff:fea4:bebd",
            ],
          - [
              - "fe80::fc6e:abff:fe01:b100",
            ],
          - [
              - "fe80::288f:64ff:fe3d:eb66",
            ],
          - [
              - "fe80::d0b5:86ff:fe30:1b3",
            ],
        ] -> (known after apply)
      ~ mac_addresses           = [
          - "00:00:00:00:00:00",
          - "C6:13:BB:8D:1E:39",
          - "9E:D4:BE:34:E2:AD",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "BC:24:11:7C:CC:E6",
          - "8E:C6:B2:3D:95:15",
          - "32:57:8F:26:A2:75",
          - "0A:EB:50:C4:81:15",
          - "72:BA:9A:A4:BE:BD",
          - "FE:6E:AB:01:B1:00",
          - "2A:8F:64:3D:EB:66",
          - "D2:B5:86:30:01:B3",
        ] -> (known after apply)
        name                    = "talos-controlplane"
      ~ network_interface_names = [
          - "lo",
          - "bond0",
          - "dummy0",
          - "teql0",
          - "tunl0",
          - "sit0",
          - "ip6tnl0",
          - "eth0",
          - "cilium_net",
          - "cilium_host",
          - "cilium_vxlan",
          - "lxc_health",
          - "lxc4031c3dbfcba",
          - "lxc1df905adc62c",
          - "lxca938d72e0216",
        ] -> (known after apply)
      + reboot_after_update     = true
      ~ tags                    = [
          - "talos",
            "terraform",
          + "talos",
        ]
      ~ vm_id                   = 100 -> (known after apply)
        # (24 unchanged attributes hidden)

      ~ cpu {
          - flags        = [] -> null
            # (9 unchanged attributes hidden)
        }

      ~ disk {
          ~ file_id           = "local:iso/talos-nocloud-amd64.img" # forces replacement -> (known after apply) # forces replacement
          ~ path_in_datastore = "vm-100-disk-0" -> (known after apply)
            # (12 unchanged attributes hidden)
        }

      ~ initialization {
          - interface            = "ide2" -> null
          + meta_data_file_id    = (known after apply)
          + network_data_file_id = (known after apply)
          + type                 = (known after apply)
          + user_data_file_id    = (known after apply)
          + vendor_data_file_id  = (known after apply)
            # (1 unchanged attribute hidden)

            # (1 unchanged block hidden)
        }

      ~ network_device {
          - disconnected = false -> null
          ~ mac_address  = "BC:24:11:7C:CC:E6" -> (known after apply)
            # (9 unchanged attributes hidden)
        }

      ~ vga {
          + acpi                    = (known after apply)
          + bios                    = (known after apply)
          + boot_order              = (known after apply)
          + description             = (known after apply)
          + hook_script_file_id     = (known after apply)
          + id                      = (known after apply)
          + ipv4_addresses          = (known after apply)
          + ipv6_addresses          = (known after apply)
          + keyboard_layout         = (known after apply)
          + kvm_arguments           = (known after apply)
          + mac_addresses           = (known after apply)
          + machine                 = (known after apply)
          + migrate                 = (known after apply)
          + name                    = (known after apply)
          + network_interface_names = (known after apply)
          + node_name               = (known after apply)
          + on_boot                 = (known after apply)
          + pool_id                 = (known after apply)
          + protection              = (known after apply)
          + reboot                  = (known after apply)
          + reboot_after_update     = (known after apply)
          + scsi_hardware           = (known after apply)
          + started                 = (known after apply)
          + stop_on_destroy         = (known after apply)
          + tablet_device           = (known after apply)
          + tags                    = (known after apply)
          + template                = (known after apply)
          + timeout_clone           = (known after apply)
          + timeout_create          = (known after apply)
          + timeout_migrate         = (known after apply)
          + timeout_move_disk       = (known after apply)
          + timeout_reboot          = (known after apply)
          + timeout_shutdown_vm     = (known after apply)
          + timeout_start_vm        = (known after apply)
          + timeout_stop_vm         = (known after apply)
          + vm_id                   = (known after apply)
        } -> (known after apply)

        # (3 unchanged blocks hidden)
    }

  # proxmox_virtual_environment_vm.talos_vm["worker-1"] must be replaced
-/+ resource "proxmox_virtual_environment_vm" "talos_vm" {
      ~ id                      = "101" -> (known after apply)
      ~ ipv4_addresses          = [
          - [
              - "127.0.0.1",
              - "169.254.116.108",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "10.0.0.51",
            ],
          - [],
          - [
              - "10.244.0.237",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
        ] -> (known after apply)
      ~ ipv6_addresses          = [
          - [
              - "::1",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "fe80::be24:11ff:fe6f:15b6",
            ],
          - [
              - "fe80::c433:5ff:fe6c:b2fe",
            ],
          - [
              - "fe80::f898:aeff:fee7:4272",
            ],
          - [
              - "fe80::bcb6:10ff:fe88:a114",
            ],
          - [
              - "fe80::3c0d:aeff:fea1:3f43",
            ],
          - [
              - "fe80::a48c:19ff:fe6f:f835",
            ],
          - [
              - "fe80::b085:ecff:febc:a781",
            ],
          - [
              - "fe80::6c76:b2ff:fef7:5053",
            ],
          - [
              - "fe80::b872:46ff:fee8:a17b",
            ],
          - [
              - "fe80::7ce9:e6ff:fe12:f397",
            ],
          - [
              - "fe80::901d:20ff:fef9:a4bb",
            ],
          - [
              - "fe80::f0f6:88ff:fe51:cdcc",
            ],
          - [
              - "fe80::809b:c2ff:fef4:cc5b",
            ],
          - [
              - "fe80::b033:73ff:fea3:650c",
            ],
          - [
              - "fe80::202d:b4ff:fe96:1824",
            ],
          - [
              - "fe80::3cb2:d3ff:fe85:8605",
            ],
          - [
              - "fe80::24a7:95ff:feb4:4010",
            ],
          - [
              - "fe80::8fb:f9ff:fee9:63a",
            ],
          - [
              - "fe80::9434:11ff:fe46:8596",
            ],
          - [
              - "fe80::f0aa:26ff:fe6f:eb94",
            ],
          - [
              - "fe80::24b0:5ff:fedc:f4d8",
            ],
          - [
              - "fe80::3804:1eff:fe3d:633d",
            ],
          - [
              - "fe80::642f:83ff:fe50:f8f4",
            ],
          - [
              - "fe80::5cca:dcff:fef8:b8e4",
            ],
          - [
              - "fe80::ec0a:9aff:fee2:aaef",
            ],
          - [
              - "fe80::64df:c0ff:fe1f:c075",
            ],
          - [
              - "fe80::d076:5ff:fed9:bfd0",
            ],
          - [
              - "fe80::a042:dcff:fee5:75c1",
            ],
          - [
              - "fe80::b8f6:17ff:fe6e:e352",
            ],
          - [
              - "fe80::48ea:1cff:fe7f:5cdd",
            ],
          - [
              - "fe80::2c61:dbff:fed1:bc19",
            ],
          - [
              - "fe80::c6d:58ff:fe0d:b56a",
            ],
          - [
              - "fe80::58e9:eaff:fe8a:d72c",
            ],
          - [
              - "fe80::68de:50ff:fe50:d79e",
            ],
          - [
              - "fe80::8885:beff:feac:a479",
            ],
          - [
              - "fe80::14ea:7aff:fe8c:c05c",
            ],
          - [
              - "fe80::181c:b2ff:feb6:4850",
            ],
          - [
              - "fe80::582c:a6ff:fea9:3327",
            ],
          - [
              - "fe80::50f4:7ff:fef6:7118",
            ],
          - [
              - "fe80::44d3:e5ff:fed0:b216",
            ],
          - [
              - "fe80::d85c:26ff:fe43:338e",
            ],
        ] -> (known after apply)
      ~ mac_addresses           = [
          - "00:00:00:00:00:00",
          - "3E:1D:E9:83:5D:A3",
          - "A2:01:CC:78:D9:2E",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "BC:24:11:6F:15:B6",
          - "C6:33:05:6C:B2:FE",
          - "FA:98:AE:E7:42:72",
          - "BE:B6:10:88:A1:14",
          - "3E:0D:AE:A1:3F:43",
          - "A6:8C:19:6F:F8:35",
          - "B2:85:EC:BC:A7:81",
          - "6E:76:B2:F7:50:53",
          - "BA:72:46:E8:A1:7B",
          - "7E:E9:E6:12:F3:97",
          - "92:1D:20:F9:A4:BB",
          - "F2:F6:88:51:CD:CC",
          - "82:9B:C2:F4:CC:5B",
          - "B2:33:73:A3:65:0C",
          - "22:2D:B4:96:18:24",
          - "3E:B2:D3:85:86:05",
          - "26:A7:95:B4:40:10",
          - "0A:FB:F9:E9:06:3A",
          - "96:34:11:46:85:96",
          - "F2:AA:26:6F:EB:94",
          - "26:B0:05:DC:F4:D8",
          - "3A:04:1E:3D:63:3D",
          - "66:2F:83:50:F8:F4",
          - "5E:CA:DC:F8:B8:E4",
          - "EE:0A:9A:E2:AA:EF",
          - "66:DF:C0:1F:C0:75",
          - "D2:76:05:D9:BF:D0",
          - "A2:42:DC:E5:75:C1",
          - "BA:F6:17:6E:E3:52",
          - "4A:EA:1C:7F:5C:DD",
          - "2E:61:DB:D1:BC:19",
          - "0E:6D:58:0D:B5:6A",
          - "5A:E9:EA:8A:D7:2C",
          - "6A:DE:50:50:D7:9E",
          - "8A:85:BE:AC:A4:79",
          - "16:EA:7A:8C:C0:5C",
          - "1A:1C:B2:B6:48:50",
          - "5A:2C:A6:A9:33:27",
          - "52:F4:07:F6:71:18",
          - "46:D3:E5:D0:B2:16",
          - "DA:5C:26:43:33:8E",
        ] -> (known after apply)
        name                    = "talos-worker-1"
      ~ network_interface_names = [
          - "lo",
          - "bond0",
          - "dummy0",
          - "teql0",
          - "tunl0",
          - "sit0",
          - "ip6tnl0",
          - "eth0",
          - "cilium_net",
          - "cilium_host",
          - "cilium_vxlan",
          - "lxc_health",
          - "lxc1a2db94fa7e9",
          - "lxc0891a44cc6b3",
          - "lxc329079b05a69",
          - "lxc8f074ad910c9",
          - "lxcdb519e169eed",
          - "lxc309585db6836",
          - "lxc9a8a83cce428",
          - "lxc35768a7259ec",
          - "lxcaeab48c73d91",
          - "lxc5e5a0f5110c6",
          - "lxc331eca23dfeb",
          - "lxc12f47a20dcad",
          - "lxc4874c36b138e",
          - "lxc50dddad53f18",
          - "lxc61b0e4d4db77",
          - "lxcca82fb4be59c",
          - "lxcac496d16e746",
          - "lxc60a1a1be9e99",
          - "lxc6d0fdab99f2f",
          - "lxc161d35f05e01",
          - "lxca9f2139382c5",
          - "lxc4ad2518ff2db",
          - "lxc71504eefcc37",
          - "lxce01e23253c50",
          - "lxccd2e3e660ed5",
          - "lxc889881730a43",
          - "lxc58a51da7eab0",
          - "lxcbc9012e4ec4a",
          - "lxc6cc8ac6df49f",
          - "lxcc4f979bc5e05",
          - "lxc39227587c9af",
          - "lxc490d205acfec",
          - "lxc4b0e21391334",
          - "lxc33b502ccbdd8",
          - "lxce97a5964fb46",
          - "lxc1ed0a3eb488d",
        ] -> (known after apply)
      + reboot_after_update     = true
      ~ tags                    = [
          - "talos",
            "terraform",
          + "talos",
        ]
      ~ vm_id                   = 101 -> (known after apply)
        # (24 unchanged attributes hidden)

      ~ cpu {
          - flags        = [] -> null
            # (9 unchanged attributes hidden)
        }

      ~ disk {
          ~ file_id           = "local:iso/talos-nocloud-amd64.img" # forces replacement -> (known after apply) # forces replacement
          ~ path_in_datastore = "vm-101-disk-0" -> (known after apply)
            # (12 unchanged attributes hidden)
        }

      ~ initialization {
          - interface            = "ide2" -> null
          + meta_data_file_id    = (known after apply)
          + network_data_file_id = (known after apply)
          + type                 = (known after apply)
          + user_data_file_id    = (known after apply)
          + vendor_data_file_id  = (known after apply)
            # (1 unchanged attribute hidden)

            # (1 unchanged block hidden)
        }

      ~ network_device {
          - disconnected = false -> null
          ~ mac_address  = "BC:24:11:6F:15:B6" -> (known after apply)
            # (9 unchanged attributes hidden)
        }

      ~ vga {
          + acpi                    = (known after apply)
          + bios                    = (known after apply)
          + boot_order              = (known after apply)
          + description             = (known after apply)
          + hook_script_file_id     = (known after apply)
          + id                      = (known after apply)
          + ipv4_addresses          = (known after apply)
          + ipv6_addresses          = (known after apply)
          + keyboard_layout         = (known after apply)
          + kvm_arguments           = (known after apply)
          + mac_addresses           = (known after apply)
          + machine                 = (known after apply)
          + migrate                 = (known after apply)
          + name                    = (known after apply)
          + network_interface_names = (known after apply)
          + node_name               = (known after apply)
          + on_boot                 = (known after apply)
          + pool_id                 = (known after apply)
          + protection              = (known after apply)
          + reboot                  = (known after apply)
          + reboot_after_update     = (known after apply)
          + scsi_hardware           = (known after apply)
          + started                 = (known after apply)
          + stop_on_destroy         = (known after apply)
          + tablet_device           = (known after apply)
          + tags                    = (known after apply)
          + template                = (known after apply)
          + timeout_clone           = (known after apply)
          + timeout_create          = (known after apply)
          + timeout_migrate         = (known after apply)
          + timeout_move_disk       = (known after apply)
          + timeout_reboot          = (known after apply)
          + timeout_shutdown_vm     = (known after apply)
          + timeout_start_vm        = (known after apply)
          + timeout_stop_vm         = (known after apply)
          + vm_id                   = (known after apply)
        } -> (known after apply)

        # (3 unchanged blocks hidden)
    }

  # proxmox_virtual_environment_vm.talos_vm["worker-2"] must be replaced
-/+ resource "proxmox_virtual_environment_vm" "talos_vm" {
      ~ id                      = "102" -> (known after apply)
      ~ ipv4_addresses          = [
          - [
              - "127.0.0.1",
              - "169.254.116.108",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "10.0.0.52",
            ],
          - [],
          - [
              - "10.244.1.28",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
        ] -> (known after apply)
      ~ ipv6_addresses          = [
          - [
              - "::1",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "fe80::be24:11ff:fe45:f407",
            ],
          - [
              - "fe80::e0bd:60ff:fe5f:99cc",
            ],
          - [
              - "fe80::7c7f:3dff:fe1e:fd00",
            ],
          - [
              - "fe80::1410:e6ff:fec9:d636",
            ],
          - [
              - "fe80::4ce0:fbff:feaf:1b71",
            ],
          - [
              - "fe80::8cdc:66ff:feac:4ee",
            ],
          - [
              - "fe80::1808:cfff:fe2b:bbf3",
            ],
          - [
              - "fe80::5c4a:dfff:fe20:5f7e",
            ],
          - [
              - "fe80::c84e:efff:feb7:7541",
            ],
          - [
              - "fe80::9413:1ff:fef9:a743",
            ],
          - [
              - "fe80::14ba:89ff:fe88:390c",
            ],
          - [
              - "fe80::d47c:6dff:fef1:906a",
            ],
          - [
              - "fe80::502f:2bff:fefa:290a",
            ],
          - [
              - "fe80::b8e6:aaff:fed2:5c38",
            ],
          - [
              - "fe80::4cf6:f7ff:fede:e5d7",
            ],
          - [
              - "fe80::4452:77ff:fe16:ffd5",
            ],
          - [
              - "fe80::9c6b:dfff:fe01:f905",
            ],
        ] -> (known after apply)
      ~ mac_addresses           = [
          - "00:00:00:00:00:00",
          - "8E:5F:84:89:6B:36",
          - "42:63:EC:43:6A:4E",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "BC:24:11:45:F4:07",
          - "E2:BD:60:5F:99:CC",
          - "7E:7F:3D:1E:FD:00",
          - "16:10:E6:C9:D6:36",
          - "4E:E0:FB:AF:1B:71",
          - "8E:DC:66:AC:04:EE",
          - "1A:08:CF:2B:BB:F3",
          - "5E:4A:DF:20:5F:7E",
          - "CA:4E:EF:B7:75:41",
          - "96:13:01:F9:A7:43",
          - "16:BA:89:88:39:0C",
          - "D6:7C:6D:F1:90:6A",
          - "52:2F:2B:FA:29:0A",
          - "BA:E6:AA:D2:5C:38",
          - "4E:F6:F7:DE:E5:D7",
          - "46:52:77:16:FF:D5",
          - "9E:6B:DF:01:F9:05",
        ] -> (known after apply)
        name                    = "talos-worker-2"
      ~ network_interface_names = [
          - "lo",
          - "bond0",
          - "dummy0",
          - "teql0",
          - "tunl0",
          - "sit0",
          - "ip6tnl0",
          - "eth0",
          - "cilium_net",
          - "cilium_host",
          - "cilium_vxlan",
          - "lxc_health",
          - "lxce83f328706fe",
          - "lxc9b5141743f51",
          - "lxc6bdc49e56ed9",
          - "lxc735a55d9b5dd",
          - "lxca0ad52e06271",
          - "lxcb8d9003aa5b6",
          - "lxc25249e8b81fb",
          - "lxc38bebd0c35b1",
          - "lxc7577ffe7e764",
          - "lxc90d9f58915df",
          - "lxc21c752d75d5f",
          - "lxc153e59f725c3",
        ] -> (known after apply)
      + reboot_after_update     = true
      ~ tags                    = [
          - "talos",
            "terraform",
          + "talos",
        ]
      ~ vm_id                   = 102 -> (known after apply)
        # (24 unchanged attributes hidden)

      ~ cpu {
          - flags        = [] -> null
            # (9 unchanged attributes hidden)
        }

      ~ disk {
          ~ file_id           = "local:iso/talos-nocloud-amd64.img" # forces replacement -> (known after apply) # forces replacement
          ~ path_in_datastore = "vm-102-disk-0" -> (known after apply)
            # (12 unchanged attributes hidden)
        }

      ~ initialization {
          - interface            = "ide2" -> null
          + meta_data_file_id    = (known after apply)
          + network_data_file_id = (known after apply)
          + type                 = (known after apply)
          + user_data_file_id    = (known after apply)
          + vendor_data_file_id  = (known after apply)
            # (1 unchanged attribute hidden)

            # (1 unchanged block hidden)
        }

      ~ network_device {
          - disconnected = false -> null
          ~ mac_address  = "BC:24:11:45:F4:07" -> (known after apply)
            # (9 unchanged attributes hidden)
        }

      ~ vga {
          + acpi                    = (known after apply)
          + bios                    = (known after apply)
          + boot_order              = (known after apply)
          + description             = (known after apply)
          + hook_script_file_id     = (known after apply)
          + id                      = (known after apply)
          + ipv4_addresses          = (known after apply)
          + ipv6_addresses          = (known after apply)
          + keyboard_layout         = (known after apply)
          + kvm_arguments           = (known after apply)
          + mac_addresses           = (known after apply)
          + machine                 = (known after apply)
          + migrate                 = (known after apply)
          + name                    = (known after apply)
          + network_interface_names = (known after apply)
          + node_name               = (known after apply)
          + on_boot                 = (known after apply)
          + pool_id                 = (known after apply)
          + protection              = (known after apply)
          + reboot                  = (known after apply)
          + reboot_after_update     = (known after apply)
          + scsi_hardware           = (known after apply)
          + started                 = (known after apply)
          + stop_on_destroy         = (known after apply)
          + tablet_device           = (known after apply)
          + tags                    = (known after apply)
          + template                = (known after apply)
          + timeout_clone           = (known after apply)
          + timeout_create          = (known after apply)
          + timeout_migrate         = (known after apply)
          + timeout_move_disk       = (known after apply)
          + timeout_reboot          = (known after apply)
          + timeout_shutdown_vm     = (known after apply)
          + timeout_start_vm        = (known after apply)
          + timeout_stop_vm         = (known after apply)
          + vm_id                   = (known after apply)
        } -> (known after apply)

        # (3 unchanged blocks hidden)
    }

  # talos_machine_configuration_apply.config_apply["controlplane"] will be updated in-place
  ~ resource "talos_machine_configuration_apply" "config_apply" {
        id                          = "machine_configuration_apply"
      ~ machine_configuration       = (sensitive value)
      ~ machine_configuration_input = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # talos_machine_configuration_apply.config_apply["worker-1"] will be updated in-place
  ~ resource "talos_machine_configuration_apply" "config_apply" {
        id                          = "machine_configuration_apply"
      ~ machine_configuration       = (sensitive value)
      ~ machine_configuration_input = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # talos_machine_configuration_apply.config_apply["worker-2"] will be updated in-place
  ~ resource "talos_machine_configuration_apply" "config_apply" {
        id                          = "machine_configuration_apply"
      ~ machine_configuration       = (sensitive value)
      ~ machine_configuration_input = (sensitive value)
        # (5 unchanged attributes hidden)
    }

Plan: 5 to add, 3 to change, 5 to destroy.

Warning: Redundant ignore_changes element

  on main.tf line 33, in resource "proxmox_virtual_environment_vm" "talos_vm":
  33: resource "proxmox_virtual_environment_vm" "talos_vm" {

Adding an attribute name to ignore_changes tells Terraform to ignore future
changes to the argument in configuration after the object has been created,
retaining the value originally configured.

The attribute network_interface_names is decided by the provider alone and
therefore there can be no configured value to compare with. Including this
attribute in ignore_changes has no effect. Remove the attribute from
ignore_changes to quiet this warning.

(and 2 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────
```
</details>

</details>